Max-Hsu/Homework/G2-1/Embedded/1229/Measure/Philips/LPC325x.h
/* peripheral multiplexer */
#define P_MUX_SET		(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x100))
#define P_MUX_CLR		(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x104))
#define P_MUX_STATE		(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x108))

#define P0_MUX_SET		(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x120))
#define P0_MUX_CLR		(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x124))
#define P0_MUX_STATE	(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x128))

#define P1_MUX_SET		(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x130))
#define P1_MUX_CLR		(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x134))
#define P1_MUX_STATE	(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x138))

#define P2_MUX_SET		(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x28))
#define P2_MUX_CLR		(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x2C))
#define P2_MUX_STATE	(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x30))

#define P3_MUX_SET		(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x110))
#define P3_MUX_CLR		(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x114))
#define P3_MUX_STATE	(*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x118))

/* USB Device */
#define USB_BASE_ADDR	0x31020200
/* Device Interrupt Registers */
#define DEV_INT_STAT	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x00))
#define DEV_INT_EN		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x04))
#define DEV_INT_CLR		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x08))
#define DEV_INT_SET		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x0C))
#define DEV_INT_PRIO	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x2C))

/* Endpoint Interrupt Registers */
#define EP_INT_STAT	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x30))
#define EP_INT_EN	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x34))
#define EP_INT_CLR	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x38))
#define EP_INT_SET	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x3C))
#define EP_INT_PRIO	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x40))

/* Endpoint Realization Registers */
#define REALIZE_EP		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x44))
#define EP_INDEX		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x48))
#define MAXPACKET_SIZE	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x4C))

/* Command Reagisters */
#define CMD_CODE	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x10))
#define CMD_DATA	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x14))

/* Data Transfer Registers */
#define RX_DATA		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x18))
#define TX_DATA		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x1C))
#define RX_PLENGTH	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x20))
#define TX_PLENGTH	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x24))
#define USB_CTRL	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x28))

/* System Register */
#define DC_REVISION	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x7C))

/* DMA Registers */
#define DMA_REQ_STAT	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x50))
#define DMA_REQ_CLR		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x54))
#define DMA_REQ_SET		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x58))
#define UDCA_HEAD		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x80))
#define EP_DMA_STAT		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x84))
#define EP_DMA_EN		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x88))
#define EP_DMA_DIS		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x8C))
#define DMA_INT_STAT	(*(volatile unsigned long *)(USB_BASE_ADDR + 0x90))
#define DMA_INT_EN		(*(volatile unsigned long *)(USB_BASE_ADDR + 0x94))
#define EOT_INT_STAT	(*(volatile unsigned long *)(USB_BASE_ADDR + 0xA0))
#define EOT_INT_CLR		(*(volatile unsigned long *)(USB_BASE_ADDR + 0xA4))
#define EOT_INT_SET		(*(volatile unsigned long *)(USB_BASE_ADDR + 0xA8))
#define NDD_REQ_INT_STAT	(*(volatile unsigned long *)(USB_BASE_ADDR + 0xAC))
#define NDD_REQ_INT_CLR		(*(volatile unsigned long *)(USB_BASE_ADDR + 0xB0))
#define NDD_REQ_INT_SET		(*(volatile unsigned long *)(USB_BASE_ADDR + 0xB4))
#define SYS_ERR_INT_STAT	(*(volatile unsigned long *)(USB_BASE_ADDR + 0xB8))
#define SYS_ERR_INT_CLR		(*(volatile unsigned long *)(USB_BASE_ADDR + 0xBC))
#define SYS_ERR_INT_SET		(*(volatile unsigned long *)(USB_BASE_ADDR + 0xC0))
#define MODULE_ID			(*(volatile unsigned long *)(USB_BASE_ADDR + 0xFC))


/* USB Host Registers */
#define USBHC_BASE_ADDR		0x31020000
#define HC_REVISION         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x00))
#define HC_CONTROL          (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x04))
#define HC_CMD_STAT         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x08))
#define HC_INT_STAT         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x0C))
#define HC_INT_EN           (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x10))
#define HC_INT_DIS          (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x14))
#define HC_HCCA             (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x18))
#define HC_PERIOD_CUR_ED    (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x1C))
#define HC_CTRL_HEAD_ED     (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x20))
#define HC_CTRL_CUR_ED      (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x24))
#define HC_BULK_HEAD_ED     (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x28))
#define HC_BULK_CUR_ED      (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x2C))
#define HC_DONE_HEAD        (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x30))
#define HC_FM_INTERVAL      (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x34))
#define HC_FM_REMAINING     (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x38))
#define HC_FM_NUMBER        (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x3C))
#define HC_PERIOD_START     (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x40))
#define HC_LS_THRHLD        (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x44))
#define HC_RH_DESCA         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x48))
#define HC_RH_DESCB         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x4C))
#define HC_RH_STAT          (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x50))
#define HC_RH_PORT_STAT1    (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x54))
#define HC_RH_PORT_STAT2    (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x58))

