Max-Hsu/Homework/G2-1/Embedded/1229/Measure/Philips/LPC325x.h
#if 0
/* USB Host Controller */
#define USBH_BASE_ADDR	0x31020000
#define HcRevision			(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x00))
#define HcControl			(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x04))
#define HcCommandStatus		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x08))
#define HcInterruptStatus	(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x0C))
#define HcInterruptEnable	(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x10))
#define HcInterruptDisable	(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x14))
#define HcHCCA				(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x18))
#define HcPeriodCurrentED	(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x1C))
#define HcControlHeadED		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x20))
#define HcControlCurrentED	(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x24))
#define HcBulkHeadED		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x28))
#define HcBulkCurrentED		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x2C))
#define HcDoneHead			(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x30))
#define HcFmInterval		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x34))
#define HcFmRemaining		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x38))
#define HcFmNumber			(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x3C))
#define HcPeriodicStart		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x40))
#define HcLSThreshold		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x44))
#define HcRhDescriptorA		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x48))
#define HcRhDescriptorB		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x4C))
#define HcRhStatus			(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x50))
#define HcRhPortStatus1		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x54))
#define HcRhPortStatus2		(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x58))
#define HcModuleID			(*(volatile unsigned long *)(USBH_BASE_ADDR + 0x5C))
#endif

/* USB OTG Controller */
#define USBOTG_BASE_ADDR	0x31020000
#define OTG_INT_STAT        (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x100))
#define OTG_INT_EN          (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x104))
#define OTG_INT_SET         (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x108))
#define OTG_INT_CLR         (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x10C))
#define OTG_STAT_CTRL       (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x110))
#define OTG_TIMER           (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x114))

#define OTG_I2C_RX          (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x300))
#define OTG_I2C_TX          (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x300))
#define OTG_I2C_STS         (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x304))
#define OTG_I2C_CTL         (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x308))
#define OTG_I2C_CLKHI       (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x30C))
#define OTG_I2C_CLKLO       (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x310))

#define OTG_CLK_CTRL        (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0xFF4))
#define OTG_CLK_STAT        (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0xFF8))

/* Below are redundant names as the original driver souce uses the different name 
convention for LPC24xx */
/* USB OTG */
#define OTG_int_status	(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x100))
#define OTG_int_enable	(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x104))
#define OTG_int_set		(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x108))
#define OTG_int_clear	(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x10C))
#define OTG_status_ctrl	(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x110))
#define OTG_timer		(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x114))

/* USB OTG I2C register */
#define I2C_RX			(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x300))
#define I2C_TX			(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x300))
#define I2C_STS			(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x304))
#define I2C_CTRL		(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x308))
#define I2C_CLKH		(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x30C))
#define I2C_CLKL		(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x310))

/* OTG clock control registers */
#define OTG_clock_control	(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0xFF4))
#define OTG_clock_status	(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0xFF8))
#define OTG_module_id		(*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0xFFC))

							
/* Universal Asynchronous Receiver Transmitter (Standard UART3,4,5,6) */
#define UART3_BASE_ADDR		0x40080000
#define U3RBR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define U3THR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define U3DLL          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define U3DLM          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x04))
#define U3IER          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x04))
#define U3IIR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x08))
#define U3FCR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x08))
#define U3LCR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x0C))
#define U3LSR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x14))
#define U3RXLEV        (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x1C))

#define UART4_BASE_ADDR		0x40088000
#define U4RBR          (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x00))
#define U4THR          (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x00))
#define U4DLL          (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x00))
#define U4DLM          (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x04))
#define U4IER          (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x04))
#define U4IIR          (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x08))
#define U4FCR          (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x08))
#define U4LCR          (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x0C))
#define U4LSR          (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x14))
#define U4RXLEV        (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x1C))

#define UART5_BASE_ADDR		0x40090000
#define U5RBR          (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x00))
#define U5THR          (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x00))
#define U5DLL          (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x00))
#define U5DLM          (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x04))
#define U5IER          (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x04))
#define U5IIR          (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x08))
#define U5FCR          (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x08))
#define U5LCR          (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x0C))
#define U5LSR          (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x14))
#define U5RXLEV        (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x1C))

#define UART6_BASE_ADDR		0x40098000
#define U6RBR          (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x00))
#define U6THR          (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x00))
#define U6DLL          (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x00))
#define U6DLM          (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x04))
#define U6IER          (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x04))
#define U6IIR          (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x08))
#define U6FCR          (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x08))
#define U6LCR          (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x0C))
#define U6LSR          (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x14))
#define U6RXLEV        (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x1C))

#define UART_CLK_BASE_ADDR	0x40004000
#define U3CLK          (*(volatile unsigned long *)(UART_CLK_BASE_ADDR + 0xD0))
#define U4CLK          (*(volatile unsigned long *)(UART_CLK_BASE_ADDR + 0xD4))
#define U5CLK          (*(volatile unsigned long *)(UART_CLK_BASE_ADDR + 0xD8))
#define U6CLK          (*(volatile unsigned long *)(UART_CLK_BASE_ADDR + 0xDC))
#define IRDACLK        (*(volatile unsigned long *)(UART_CLK_BASE_ADDR + 0xE0))

#define UART_CTRL_BASE_ADDR	0x40054000
#define UART_CTRL      (*(volatile unsigned long *)(UART_CTRL_BASE_ADDR + 0x00))
#define UART_CLKMODE   (*(volatile unsigned long *)(UART_CTRL_BASE_ADDR + 0x04))
#define UART_LOOP      (*(volatile unsigned long *)(UART_CTRL_BASE_ADDR + 0x08))


