Max-Hsu/Homework/G2-1/Embedded/1229/Measure/Philips/LPC325x.h
/* Real Time Clock */
#define RTC_BASE_ADDR		0x40024000
#define RTC_UCOUNT	(*(volatile unsigned long *)(RTC_BASE_ADDR + 0x00))
#define RTC_DCOUNT	(*(volatile unsigned long *)(RTC_BASE_ADDR + 0x04))
#define RTC_MATCH0	(*(volatile unsigned long *)(RTC_BASE_ADDR + 0x08))
#define RTC_MATCH1	(*(volatile unsigned long *)(RTC_BASE_ADDR + 0x0C))
#define RTC_CTRL	(*(volatile unsigned long *)(RTC_BASE_ADDR + 0x10))
#define RTC_INTSTAT	(*(volatile unsigned long *)(RTC_BASE_ADDR + 0x14))
#define RTC_KEY		(*(volatile unsigned long *)(RTC_BASE_ADDR + 0x18))
#define RTC_SRAM	(*(volatile unsigned long *)(RTC_BASE_ADDR + 0x80))

/* Watchdog timer */
#define WDTIM_BASE_ADDR		0x4003C000
#define WDTIM_INT		(*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x00))
#define WDTIM_CTRL		(*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x04))
#define WDTIM_COUNTER	(*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x08))
#define WDTIM_MCTRL		(*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x0C))
#define WDTIM_MATCH0	(*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x10))
#define WDTIM_EMR		(*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x14))
#define WDTIM_PULSE		(*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x18))
#define WDTIM_RES		(*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x1C))


/* A/D Converter */
#define ADC_BASE_ADDR		0x40048000
#define ADSTAT		(*(volatile unsigned long *)(ADC_BASE_ADDR + 0x00))
#define ADSEL		(*(volatile unsigned long *)(ADC_BASE_ADDR + 0x04))
#define ADCON		(*(volatile unsigned long *)(ADC_BASE_ADDR + 0x08))
#define ADDAT		(*(volatile unsigned long *)(ADC_BASE_ADDR + 0x48))


/* DMA */
#define DMA_BASE_ADDR		0x31000000
#define GPDMA_INT_STAT         (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x000))
#define GPDMA_INT_TCSTAT       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x004))
#define GPDMA_INT_TCCLR        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x008))
#define GPDMA_INT_ERR_STAT     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x00C))
#define GPDMA_INT_ERR_CLR      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x010))
#define GPDMA_RAW_INT_TCSTAT   (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x014))
#define GPDMA_RAW_INT_ERR_STAT (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x018))
#define GPDMA_ENABLED_CHNS     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x01C))
#define GPDMA_SOFT_BREQ        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x020))
#define GPDMA_SOFT_SREQ        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x024))
#define GPDMA_SOFT_LBREQ       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x028))
#define GPDMA_SOFT_LSREQ       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x02C))
#define GPDMA_CONFIG           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x030))
#define GPDMA_SYNC             (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x034))

/* DMA channel 0 registers */
#define GPDMA_CH0_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x100))
#define GPDMA_CH0_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x104))
#define GPDMA_CH0_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x108))
#define GPDMA_CH0_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x10C))
#define GPDMA_CH0_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x110))

/* DMA channel 1 registers */
#define GPDMA_CH1_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x120))
#define GPDMA_CH1_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x124))
#define GPDMA_CH1_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x128))
#define GPDMA_CH1_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x12C))
#define GPDMA_CH1_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x130))

/* DMA channel 2 registers */
#define GPDMA_CH2_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x140))
#define GPDMA_CH2_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x144))
#define GPDMA_CH2_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x148))
#define GPDMA_CH2_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x14C))
#define GPDMA_CH2_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x150))

/* DMA channel 3 registers */
#define GPDMA_CH3_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x160))
#define GPDMA_CH3_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x164))
#define GPDMA_CH3_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x168))
#define GPDMA_CH3_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x16C))
#define GPDMA_CH3_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x170))

/* DMA channel 4 registers */
#define GPDMA_CH4_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x180))
#define GPDMA_CH4_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x184))
#define GPDMA_CH4_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x188))
#define GPDMA_CH4_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x18C))
#define GPDMA_CH4_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x190))

/* DMA channel 5 registers */
#define GPDMA_CH5_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1A0))
#define GPDMA_CH5_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1A4))
#define GPDMA_CH5_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1A8))
#define GPDMA_CH5_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1AC))
#define GPDMA_CH5_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1B0))

/* DMA channel 6 registers */
#define GPDMA_CH6_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1C0))
#define GPDMA_CH6_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1C4))
#define GPDMA_CH6_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1C8))
#define GPDMA_CH6_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1CC))
#define GPDMA_CH6_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1D0))

/* DMA channel 7 registers */
#define GPDMA_CH7_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1E0))
#define GPDMA_CH7_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1E4))
#define GPDMA_CH7_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1E8))
#define GPDMA_CH7_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1EC))
#define GPDMA_CH7_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1F0))

